config/Documents/КорректировкаНачальныхОстатковДляТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаНачальныхОстатковДляТО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииЖНВЛС</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПоСтНДСПоСкладам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РознСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСЗакуп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРознСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРознНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Documents/КорректировкаНачальныхОстатковДляТО/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//------------------<Затычка для сведения товрных отчетов при переходах с одной базы на другую>-------------------GtG----11.02.2008
	ДВ= ЭтотОбъект.Движения.ОстаткиПоСтНДСПоСкладам;
	
	ДТ= ЭтотОбъект.Движения.ПартииЖНВЛС;
	
	Для каждого Стр из Товар Цикл
		Движняк=ДВ.Добавить();
		Движняк.Активность=Истина;
		Движняк.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движняк.Период=ДАта;
		Движняк.Регистратор= ЭтотОбъект;
		Движняк.Склад=Склад;
		Движняк.Фирма=Фирма;
		Движняк.СтавкаНДС=Стр.СтавкаНДС;
		Движняк.СуммаЗакупСНДС=Стр.СуммаЗакупСНДС;
		Движняк.СуммаНДСЗакуп=Стр.СуммаНДСЗакуп;
		Движняк.СуммаРознНДС=Стр.СуммаРознНДС;
		Движняк.СуммаРознСНДС=Стр.СуммаРознСНДС;
		
		Движ=ДТ.Добавить();
		Движ.Активность=Истина;
		Движ.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движ.Период=ДАта;
		Движ.Регистратор= ЭтотОбъект;
		Движ.Склад=Склад;
		Движ.Фирма=Фирма;
		Движ.Товар=Стр.Товар;
		Движ.Партия="";
		Движ.СтавкаНДС=Стр.СтавкаНДС;
		Движ.СуммаЗакупСНДС=Стр.СуммаЗакупСНДС;
		Движ.СуммаНДСЗакуп=Стр.СуммаНДСЗакуп;
		Движ.СуммаРознНДС=Стр.СуммаРознНДС;
		Движ.СуммаРознСНДС=Стр.СуммаРознСНДС;

		
		
		
		
		
		
	КонецЦикла;	
	
	ДВ.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	    ЗакупСумма=ТОВар.Итог("СуммаЗакупСНДС");
		РознСумма =ТОвар.Итог("СуммаРознСНДС");
	
	
	
КонецПроцедуры
